[{"pk": 2, "model": "content_blocks.contentblock", "fields": {"content": "## Services\r\n\r\nWhether you’re looking for plumbing, HVAC, fire protection, electrical engineering, or energy conservation, EMCAD offers complete engineering design and construction support services. We work with clients through every step of the engineering process, analysing your needs and designing the most efficient and cost effective solution that works for you. \r\n\r\n## What Can We Do For You?\r\n\r\n* New and renovation projects  \r\n* Electrical services including LED lighting  \r\n* Mechanical services including chiller/boiler plants, heat pumps, fan coils  \r\n* Plumbing services. We are experts in the trouble free application of plastic piping in high-rise construction  \r\n* Fire protection services including fully sprinklered buildings and standpipe systems.  \r\n* Street lighting and power distribution design, including LED lighting  \r\n* Energy conservation strategies, including LEED, Geothermal and Solar systems  \r\n* Indoor air quality systems including energy recovery ventilation systems  \r\n* High-Rise Building expertise  \r\n* Construction support services. Our design/build background means added value services for our clients", "slug": "services", "title": "Services"}}, {"pk": 4, "model": "content_blocks.contentblock", "fields": {"content": "## Projects in Your Community\r\n\r\nEvery building presents unique challenges – energy conservation, challenging retrofits, life safety issues, areas of refuge, smoke control measures, large-scale heating and cooling systems. Our expertise has grown to cover a broad range of commercial, residential, institutional and unique special projects.   \r\n\r\nWe engineer confidence into every project, from concept to completion. With 25 years on the job and more than 1250 projects across the province and internationally, we’ve built a reputation for delivering innovative and cost effective solutions.", "slug": "projects", "title": "Projects"}}, {"pk": 1, "model": "content_blocks.contentblock", "fields": {"content": "## EMCAD - We bring buildings to life\r\n\r\nNo matter how well designed and constructed, a building doesn’t really come to life until you switch on the air, water and energy systems that make it livable. We engineer the systems that transform buildings into comfortable and energy efficient places to live and work.    \r\n\r\nEMCAD Consulting Engineers is a mechanical, electrical and plumbing consulting engineering firm. We specialize in high-rise buildings and electrical, HVAC, plumbing and fire protection systems that incorporate high efficiency and \u0003sustainability. We deliver practical leading-edge design solutions to residential, commercial, institutional, and industrial building projects.   \r\n\r\nWe are building the future with a focus on the environment and innovative engineering and design. We’re ready to assist you with AutoCAD and Revit BIM design, and help your development [Go Green](/why-emcad/go-green/) or work towards \u0003[LEED](/why-emcad/leed/) certification.\r\n\r\n## Let us help you shape a better world, and make a positive difference in your community.", "slug": "home", "title": "Home"}}, {"pk": 3, "model": "content_blocks.contentblock", "fields": {"content": "## Contact Us\r\n#### Address:\r\n150-759 Hyde Park Rd  \r\nLondon, ON N6H 3S2\r\n\r\n#### Phone:\r\nDavid Myles: (519) 641-3040\r\n\r\n#### Email:\r\n<general@emcad.ca>", "slug": "contact", "title": "Contact"}}, {"pk": 6, "model": "content_blocks.contentblock", "fields": {"content": "## Who We Are\r\n\r\nEMCAD designs confidence into every project, from concept to completion. With 25 years on the job and more than 1250 projects across the province, Canada and around the world, our team of dedicated engineers draws on practical experience and design-build skills to realize workable designs that save our clients time and money.", "slug": "who_we_are", "title": "Who We Are"}}, {"pk": 8, "model": "content_blocks.contentblock", "fields": {"content": "## Our Project Team\r\n\r\nWe succeed because we deliver value. From residential to industrial to commercial, high-rise to low-rise, renovations and retrofits, prisons, seniors buildings, we provide all our clients with innovative, practical engineering solutions.\r\n\r\nWe value strong construction backgrounds and practical experience in a wide variety of skill areas. We like to challenge assumptions, promote fresh ideas, and come up with new alternatives. We have a commitment to bringing the best hardware, software, expertise and human resources to every job.\r\n\r\n> Whether you want more cost effective designs, to green your development or you want to take advantage of Revit’s BIM 3D building information modelling design software, let our team of professionals give you an edge.\r\n\r\n## Career Opportunities\r\n\r\nIf you have a strong construction background and practical experience and are looking to work in a challenging technical environment, we’d like to hear from you!\r\n\r\nPlease send a cover letter and your resume to: <general@emcad.ca>", "slug": "who_team", "title": "Who We Are - Our Project Team"}}, {"pk": 10, "model": "content_blocks.contentblock", "fields": {"content": "> Good engineering design can cut your construction costs by 10-15% and more in life cycle costs", "slug": "why_emcad_quote", "title": "Why EMCAD - Quote"}}, {"pk": 12, "model": "content_blocks.contentblock", "fields": {"content": "## LEED\r\n\r\nThe LEED (Leadership in Energy and Environmental Design) Green Building Rating System® is a voluntary, consensus-based national standard for developing high-performance, sustainable buildings. It was created to define \"green buildings\" by establishing a common standard. LEED emphasizes state-of-the-art strategies for sustainable site development, water savings, energy efficiency, materials selection and indoor environmental quality.\r\n\r\nPlumbing, HVAC and Electrical Systems are integral components to LEED Certification. \r\n\r\nEMCAD Consulting Engineers are currently working on a number of green building projects.", "slug": "why_leed", "title": "Why EMCAD - LEED"}}, {"pk": 11, "model": "content_blocks.contentblock", "fields": {"content": "## Go Green\r\n\r\nOur commitment for a sustainable future is engineered into every one of our design decisions. Let us tap into our extensive experience working in LEED environments to help you go green.  From solar energy, to waste water management and energy conservation, we offer clients the best ideas from LEED to design your building with the same energy efficiencies and new technologies without the certification costs.   \r\n\r\n## Let us show you how to green up your building.\r\n\r\n* geothermal HVAC systems \r\n* solar hot water heating systems \r\n* solar power, renewable energy \r\n* energy recovery ventilators \r\n* rainwater recovery and recycle \r\n* motion-controlled LED lighting systems \r\n* variable speed pump drives \r\n* condensing boiler systems\r\n\r\nEMCAD Consulting Engineers have engineered a number of green building projects.", "slug": "why_green", "title": "Why EMCAD - Go Green"}}, {"pk": 5, "model": "content_blocks.contentblock", "fields": {"content": "## David W. Myles, P.Eng.\r\n\r\n“Clients tell me one of the biggest concerns in our industry is over designing and the lack of reliable experienced construction support. I pride myself on delivering innovative but practical engineering designs that can be built on time, and on or under budget.\r\n\r\nI started out in the business more than 25 years ago working in my family’s design-build electrical mechanical firm. I know what it means when something goes wrong in construction, and how vital a quick effective response is. I lived it. When you discover that a duct is running into a beam, you need a solution yesterday.\r\n\r\nWe engineer confidence and hands-on practical experience into every project. EMCAD provides a full range of electrical, mechanical and life safety protection services. We can assist in projects from the conceptual design stage right through to the administration of construction contracts.\r\n\r\n> We deliver better, more efficient designs, and get the job done on time. That’s why so many developer clients have used us exclusively for more than 25 years.”", "slug": "who_dave", "title": "Who We Are - David Myles"}}, {"pk": 7, "model": "content_blocks.contentblock", "fields": {"content": "## Giving Back\r\n\r\n* EMCAD is committed to giving back to the communities that support us. We volunteer our time, money, and expertise to numerous local not-for-profit organizations, causes, and foundations.\r\n* David Myles has been supporting the Canadian Lung Association for the past 15 years by helping to organize charity golf tournaments.\r\n* EMCAD designed the Women’s Community House in London, Ontario, and donated a portion of its fees in support of the Women’s Shelter.\r\n* EMCAD is an ongoing sponsor of a number of kid’s hockey, baseball and soccer teams.", "slug": "who_giving", "title": "Who We Are - Giving Back"}}, {"pk": 9, "model": "content_blocks.contentblock", "fields": {"content": "## We Deliver Better Value\r\n\r\nWe don’t over design. We deliver practical engineering designs that work, on time and on budget. Our extensive design and construction expertise saves our clients time and money.\r\n\r\n## State Of The Art Tools\r\n\r\nWe bring the best hardware, software, expertise and human resources to every job. Whether you want to [Go Green](/why-emcad/go-green/) or work towards \u0003[LEED](/why-emcad/leed/) certification, or you want to take advantage of Revit’s BIM 3D building information modeling design software, let us give you an edge.\r\n\r\n## Versatile\r\n\r\nWhen others say it can’t be done, we can. From residential to industrial to commercial, high-rise to low-rise, renovations and retrofits, prisons, seniors buildings, street lighting and power distribution systems - we’ve engineered more than 1250 projects in the past 25 years, including 90 high-rise projects since 2000.\r\n\r\n## Cost Effective\r\n\r\nFrom start to finish, we understand how critical construction and design schedules are. Let us show you how our unique design-build expertise can help you beat the toughest design and permit deadlines and save you money in development fee charges.\r\n\r\n## Client Focussed\r\n\r\nWe built our business on repeat clients and referrals by providing outstanding value and service. We assign a project manager to every one of our clients so you have one person to contact for all you needs. Satisfying your needs and exceeding expectations is the reason so much of our business comes from repeat clients.\r\n\r\n## We’re Green\r\n\r\nWe can help you [Go Green](/why-emcad/go-green/) and reduce operating costs. From solar energy, to waste water management and energy conservation, we offer clients the best ideas from \u0003[LEED](/why-emcad/leed/) without the certification costs of designing your building with the same energy efficiencies and new technologies.\r\n\r\n## BIM - Building Information Technology\r\n\r\nEMCAD Consulting Engineers is dedicated to bringing our clients more efficient and better quality designs. That means investing today in the technologies of tomorrow. We have committed the resources to work towards the strategic adoption of BIM Building Information Technology.", "slug": "why_emcad", "title": "Why EMCAD"}}]
