[{"pk": 4, "model": "projects.category", "fields": {"image": "files/projects/categories/projects_10.jpg", "slug": "special-projects", "blurb": "We work with clients to problem solve and engineer creative, practical solutions to all kinds of uniquely challenging projects.\r\n\r\nFrom retrofits and upgrades, to solar energy, wastewater management and energy conservation, EMCAD delivers the best new ideas in energy efficiency and new technology. Our work on special projects has earned us the respect and recognition of our peers, architects, developers and building owners.", "title": "Special Projects"}}, {"pk": 2, "model": "projects.category", "fields": {"image": "files/projects/categories/projects_08.jpg", "slug": "residential", "blurb": "Build your residential project better, smarter and cheaper. We provide our clients with high-quality, simple engineering solutions without the higher costs associated with larger companies.\r\n\r\nFrom hotels to large-scale multi residential developments, we represent our client’s best interests in every aspect of our service with practical advice and workable designs built to suit the specific mechanical, electrical and environmental needs of your project.  Over the past ten years, EMCAD has designed more than 90 multi-residential projects.", "title": "Residential"}}, {"pk": 1, "model": "projects.category", "fields": {"image": "files/projects/categories/projects_06.jpg", "slug": "commercial", "blurb": "Our highly experienced design team have delivered innovative and cost effective mechanical and electrical packages to a wide variety of commercial developments. Our many repeat commercial clients know that our unique design-build expertise helps them stay a step ahead of design and permit deadlines, and saves them money on development fee charges.\r\n\r\nWe represent our client’s best interests in every aspect of our service with practical advice and workable designs built to suit the specific \u0003mechanical, electrical and environmental needs of your project.", "title": "Commercial"}}, {"pk": 4, "model": "projects.project", "fields": {"category": 2, "subtitle": "Project: Oxford Gardens Retirement Home", "title": "Seniors Buildings", "image": "files/projects/thumbs/residential_index_seniors.jpg", "content": "## Specifications:\r\n\r\n150,000 square feet, 120 Units\r\nHVAC System - Solar assisted heating and cooling system\r\n\r\n## Challenge:\r\n\r\nEngineer a solar energy system capable of powering air conditioning.\r\n\r\n## Solution:\r\n\r\nEMCAD participated in a groundbreaking pilot program sponsored by the Canadian federal government and partially funded with German solar power incentives. State-of-art solar tube collectors were installed on the roof to generate energy for building air conditioning and heating, domestic hot water and pool heating.", "slug": "seniors-buildings", "blurb": "EMCAD provided design and construction services to Oxford Gardens Retirement Home - a complete renovation/conversion of a 200-room nursing home into a 120-suite resort style independent living community.\r\n\r\nA ground-breaking solar energy pilot program."}}, {"pk": 5, "model": "projects.project", "fields": {"category": 2, "subtitle": "Project: Gainsborough Seniors Residence", "title": "Low-Rise", "image": "files/projects/thumbs/residential_index_lowrise.jpg", "content": "## Specifications:\r\n\r\n4 floors -120 Units\r\n\r\n## Challenge:\r\n\r\nEMCAD was contracted to design an HVAC system suited to very tight utility spaces. The client wanted to preserve the look of the exterior facade and did not want any air conditioning units on the ground or on the exterior walls.\r\n\r\n## Solution:\r\n\r\nEMCAD designed a system featuring a combination hot water and space heating system with a hot water tanks powered by natural gas in every suite, saving energy and space.  EMCAD also engineered an aesthetically pleasing air-conditioning system. Cooling units were placed on the roof of the fourth floor, hidden from view.", "slug": "low-rise", "blurb": "EMCAD provided design and construction services to the Gainsborough Seniors Residence - a four-floor 120-unit adult community complex.\r\n\r\nAn aesthetically pleasing HVAC system designed to fit very tight utility spaces."}}, {"pk": 6, "model": "projects.project", "fields": {"category": 2, "subtitle": "Project: London’s Renaissance Centre", "title": "High-Rise", "image": "files/projects/thumbs/residential_index_highrise.jpg", "content": "## Specifications:\r\n\r\n2-28 storey apartment towers \r\n526 units \r\n6 levels of parking \r\nground floor and second floor commercial podium   \r\n\r\nThe Renaissance Center is a prestigious 28-storey high-rise - London’s second tallest building and the largest residential complex. EMCAD engineered its fan coil system, with chiller and boiler plants located on the roof.", "slug": "high-rise", "blurb": "EMCAD provided design and construction services to the prestigious Renaissance Center in London, Ontario - a state-of-the-art luxury high-rise apartment building.\r\n\r\nLondon’s largest residential complex."}}, {"pk": 7, "model": "projects.project", "fields": {"category": 4, "subtitle": "Project: The West Village Student Condominium Project", "title": "Go Green", "image": "files/projects/thumbs/special_index_go_green.jpg", "content": "Read more about it in Building Strategies (PDF).\r\n\r\n## Specifications:\r\n\r\n9 Stories, 108 Units\r\n\r\n## Challenge:\r\n\r\nFrom solar energy, to waste water management and energy conservation, our client wanted to adopt the best ideas to achieve Platinum LEED certification.\r\n\r\n## Solution:\r\nSolar Domestic Hot Water Heating System\r\nStorm water collected in a cistern then used for a grey water system to all toilets and sprinkler systems\r\nEnergy Recovery Units for all building ventilation systems\r\nMotion detectors to control common area lighting\r\nEach residential unit has an “All Off” switch at the entrance to shut off all non-essential power loads when the resident exits\r\n\r\nEMCAD is now working on our second LEED building for the same client.", "slug": "go-green", "blurb": "EMCAD provided complete design and construction services to the West Village Student Condominium Project - this building achieved the highest rating possible in North America for environmental design and energy efficiency (LEED Platinum).\r\n\r\nThe best ideas for LEED certification."}}, {"pk": 1, "model": "projects.project", "fields": {"category": 1, "subtitle": "Project: Barrel Yards", "title": "Office Towers", "image": "files/projects/thumbs/commercial_index_officetowers.jpg", "content": "## Specifications:\r\n\r\n* 2-10 Storey Office Buildings.\r\n* 230,000 square feet.\r\n* 2 levels of underground parking.\r\n* HVAC System – Closed Loop Heat Pump System.", "slug": "office-towers", "blurb": "EMCAD is providing extensive design and construction support services to  Barrel Yards – a unique uptown urban community in Waterloo, Ontario, featuring town homes, apartments, hotel, office, retail/service amenities and park space."}}, {"pk": 8, "model": "projects.project", "fields": {"category": 4, "subtitle": "Project: Goodlife Fitness Centres", "title": "Retrofit", "image": "files/projects/thumbs/projects_special_home_03.jpg", "content": "## Challenge:\r\n\r\nRetrofit electrical and mechanical systems appropriate for a fitness club into existing retail spaces ranging in size from 15,000 to 70,000 \r\nsquare feet.     \r\n\r\n## Solution:\r\n\r\nFitness clubs place a high demand on ventilation air and domestic water. Retrofitting a new occupancy to a building’s existing electrical and mechanical services is very challenging and requires intensive preparatory fieldwork.", "slug": "retrofit", "blurb": "EMCAD has provided complete design and reconstruction services to 44 Goodlife Fitness Centres retrofit and new building projects across Canada.\r\n\r\nRefitting today’s HVAC systems into yesterday’s structures."}}, {"pk": 9, "model": "projects.project", "fields": {"category": 4, "subtitle": "Project: Shanghai Links Executive Residences", "title": "Shanghai Links", "image": "files/projects/thumbs/projects_special_home_07.jpg", "content": "## Specifications:\r\n\r\n* 50 residential houses and a golf clubhouse\r\n* Self-contained infrastructure for sewage and water treatment, storm water, electricity, television and telephone systems.\r\n\r\n## Challenge:\r\n\r\nBuild a complete Canadian-style housing community on a piece of recovered ocean land for Canadian-expatriates working for Shell, GM and Dupont, in Pudong, Shanghai.\r\n\r\n## Solution:\r\n\r\nEMCAD assumed complete responsibility for electrical and mechanical design and construction support for the project. Canadian house designs were adapted to Shanghai’s hotter climate with more powerful air conditioning and dehumidification units. The client wanted to use Canadian trades on the project and contracted EMCAD to hire Canadian mechanical and electrical trades and supervise their work in China.", "slug": "shanghai-links", "blurb": "EMCAD provided complete electrical, mechanical design and construction support to the construction of Shanghai Links Golf and Country Club – a unique Canadian-style executive community in Pudong, Shanghai.\r\n\r\nBringing Canadian inspiration know-how to Shanghai."}}, {"pk": 2, "model": "projects.project", "fields": {"category": 1, "subtitle": "Project: The Cobble Beach Golf Links Golf & Country Club", "title": "Golf Club House", "image": "files/projects/thumbs/commercial_index_golfclubs.jpg", "content": "## Specifications:\r\n\r\n* 32,000 square foot Golf Club House and Inn\r\n* HVAC System – 50-Ton Geothermal System\r\n\r\n## Challenge:\r\n\r\nThis spectacular, award-winning Nantucket-style clubhouse features an open main floor, wraparound terrace, a bar, four-season rooms, a \r\nten-suite luxury inn and a spa. It has the design features of a house, with the electrical, mechanical needs of a commercial building. The client did not want the stunning architecture compromised by electrical and mechanical ductwork and equipment.\r\n\r\n## Solution:\r\n\r\nEMCAD Consulting Engineers designed a unique electrical and mechanical system largely hidden from view. Instead of putting air conditioning on the ground or the roof, EMCAD adapted a geothermal system. Heating and cooling are provided by a geothermal loop into the pond next to the clubhouse.  An energy recovery ventilation system supplies energy efficient indoor air.\r\n\r\nEMCAD also designed innovative ways to hide ductwork, such as building a loft for some equipment, and moving fan coils into the basement.", "slug": "golf-clubs", "blurb": "EMCAD provided design and construction services to Cobble Beach Golf Links, a Golf & Country Club in Owen Sound, Ontario.\r\n\r\nThe architectural features of a house, with the electrical, mechanical needs of a commercial building."}}, {"pk": 2, "model": "projects.photo", "fields": {"project": 2, "caption": "The Cobble Beach Golf Links Golf & Country Club, Owen Sound, Ontario", "image": "files/projects/photos/commercial_golfclubs_cobble_beach.jpg"}}, {"pk": 3, "model": "projects.photo", "fields": {"project": 4, "caption": "Oxford Gardens Retirement Home, in Woodstock, Ontario", "image": "files/projects/photos/residential_seniors_oxfordgardens.jpg"}}, {"pk": 4, "model": "projects.photo", "fields": {"project": 5, "caption": "The Gainsborough Seniors Residence, in London, Ontario", "image": "files/projects/photos/residential_lowrise_gainsborough.jpg"}}, {"pk": 5, "model": "projects.photo", "fields": {"project": 6, "caption": "The Renaissance Center, London, Ontario", "image": "files/projects/photos/resedential_highrise_renaissance.jpg"}}, {"pk": 6, "model": "projects.photo", "fields": {"project": 7, "caption": "The West Village Student Condominium Project – Hamilton, Ontario", "image": "files/projects/photos/special_go_green_westvillage_img1.jpg"}}, {"pk": 7, "model": "projects.photo", "fields": {"project": 7, "caption": "The West Village Student Condominium Project – Hamilton, Ontario", "image": "files/projects/photos/special_go_green_westvillage_img2.jpg"}}, {"pk": 8, "model": "projects.photo", "fields": {"project": 8, "caption": "Goodlife Fitness Centres", "image": "files/projects/photos/special_retrofit.jpg"}}, {"pk": 1, "model": "projects.photo", "fields": {"project": 1, "caption": "Barrel Yards, in Waterloo, Ontario", "image": "files/projects/photos/office_03.jpg"}}, {"pk": 9, "model": "projects.photo", "fields": {"project": 9, "caption": "Shanghai Links is a community of Canadian-style timber-framed homes within a 410-acre landscaped  setting surrounded by an 18-hole Jack Nicklaus golf course", "image": "files/projects/photos/projects_special_shanghai_shanghai_links_03.jpg"}}]
